; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v6 - type_2 ?v1 - type_3)
 	      (pred_3 ?v4 - object ?v1 - type_3)
	      (pred_2 ?v6 - type_2 ?v3 - type_1)
	      (pred_1 ?v6 - type_2 ?v4 - object ?v3 - type_1))

   (:action op_2
       :parameters  (?v6 - type_2 ?v7 ?v5 - type_3)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v5)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_2 ?v2 - object ?v8 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v8) (pred_4 ?v6 ?v8) (pred_2 ?v6 ?v3))
       :effect (and (pred_1 ?v6 ?v2 ?v3)
		    (not (pred_3 ?v2 ?v8)) 
		    (not (pred_2 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_2 ?v2 - object ?v8 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_1 ?v6 ?v2 ?v3) (pred_4 ?v6 ?v8))
       :effect (and (pred_3 ?v2 ?v8)
		    (pred_2 ?v6 ?v3)
		    (not (pred_1 ?v6 ?v2 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_02 - type_2
obj_11 obj_03 obj_12 obj_06 - type_1
obj_10 obj_13 obj_08 obj_09 - type_3
obj_04 obj_01 obj_07 - object)
(:init
(pred_4 obj_05 obj_10)
(pred_2 obj_05 obj_11)
(pred_2 obj_05 obj_03)
(pred_4 obj_02 obj_13)
(pred_2 obj_02 obj_12)
(pred_2 obj_02 obj_06)
(pred_3 obj_04 obj_10)
(pred_3 obj_01 obj_08)
(pred_3 obj_07 obj_10)
)
(:goal
(and
(pred_3 obj_04 obj_09)
(pred_3 obj_01 obj_09)
(pred_3 obj_07 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_05 obj_08) (pred_4 obj_02 obj_08))))
    (always (not (and (pred_4 obj_05 obj_09) (pred_4 obj_02 obj_09))))
  )
)
)

; plan
1. (op_3 obj_05 obj_04 obj_10 obj_03)
   deleted: (pred_3 obj_04 obj_10) (pred_2 obj_05 obj_03)
   added: (pred_1 obj_05 obj_04 obj_03)
   goals met: 0 of 3
2. (op_2 obj_02 obj_13 obj_10)
   deleted: (pred_4 obj_02 obj_13)
   added: (pred_4 obj_02 obj_10)
   goals met: 0 of 3
3. (op_3 obj_02 obj_07 obj_10 obj_06)
   deleted: (pred_3 obj_07 obj_10) (pred_2 obj_02 obj_06)
   added: (pred_1 obj_02 obj_07 obj_06)
   goals met: 0 of 3
4. (op_2 obj_05 obj_10 obj_09)
   deleted: (pred_4 obj_05 obj_10)
   added: (pred_4 obj_05 obj_09)
   goals met: 0 of 3
5. (op_1 obj_05 obj_04 obj_09 obj_03)
   deleted: (pred_1 obj_05 obj_04 obj_03)
   added: (pred_3 obj_04 obj_09) (pred_2 obj_05 obj_03)
   goals met: 1 of 3
6. (op_2 obj_02 obj_10 obj_08)
   deleted: (pred_4 obj_02 obj_10)
   added: (pred_4 obj_02 obj_08)
   goals met: 1 of 3
7. (op_1 obj_02 obj_07 obj_08 obj_06)
   deleted: (pred_1 obj_02 obj_07 obj_06)
   added: (pred_3 obj_07 obj_08) (pred_2 obj_02 obj_06)
   goals met: 2 of 3
8. (op_3 obj_02 obj_01 obj_08 obj_12)
   deleted: (pred_3 obj_01 obj_08) (pred_2 obj_02 obj_12)
   added: (pred_1 obj_02 obj_01 obj_12)
   goals met: 2 of 3
9. (op_2 obj_05 obj_09 obj_10)
   deleted: (pred_4 obj_05 obj_09)
   added: (pred_4 obj_05 obj_10)
   goals met: 2 of 3
10. (op_2 obj_02 obj_08 obj_09)
   deleted: (pred_4 obj_02 obj_08)
   added: (pred_4 obj_02 obj_09)
   goals met: 2 of 3
11. (op_1 obj_02 obj_01 obj_09 obj_12)
   deleted: (pred_1 obj_02 obj_01 obj_12)
   added: (pred_3 obj_01 obj_09) (pred_2 obj_02 obj_12)
   goals met: 3 of 3
